// Вопрос 1:

let Tc = prompt("Введите температуру в градусах по Цельсию?", ""),
    Tf = (9 / 5) * Tc + 32;


alert(`Температура в градусах по Фаренгейту: ${Tf}`); 

console.log(`Температура в градусах по Фаренгейту: ${Tf}`);



// Вопрос 2:

let name = "Василий",
    admin = name;

alert(admin);

console.log(admin);


// Вопрос 3:
// Чему будет равно JS-выражение 1000 + "108"?
// Будет равно 1000108


// Вопрос 4:
// В чем отличие == и === ?

// == - проверяет равенство данных
// === - строгое равенство данных, проверяет и тип данных



